clusterMHDTest/ShockTUBE-Ryu/5a/CFL01/Kurganov-MHD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1024
(
0.1
0.1
0.1
0.1
0.1
0.1
0.1
0.1
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    inlet-outlet
    {
        type            zeroGradient;
    }
    top-down
    {
        type            empty;
    }
}


// ************************************************************************* //
