clusterMHDTest/ShockTUBE-Ryu/5a/CFL01/Kurganov-MHD/0/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0.5 -0.5 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1024
(
(0.75 -1 0)
(0.75 -1 0)
(0.75 -1 0)
(0.75 -1 0)
(0.75 -1 0)
(0.75 -1 0)
(0.75 -1 0)
(0.75 -1 0)
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    inlet-outlet
    {
        type            zeroGradient;
    }
    top-down
    {
        type            empty;
    }
}


// ************************************************************************* //
