clusterMHDTest/ShockTUBE-Ryu/5a/CFL01/Kurganov-MHD/system/funkySetFieldsDict
FoamFile
{
    version         2.0;
    format          ascii;


    instance        "system";
    local           "";

    class           dictionary;
    object          funkySetFieldsDict;
}


expressions
(


	regiao_1
	{
		field U;
		expression "vector(0,0,0)";
              condition "pos().x >0.5";
 
	}

	regiao_2
	{
		field U;
		expression "vector(0,0,0)";
              condition "pos().x <=0.5";
 
	}

	regiao_1
	{
		field p;
		expression "0.1";
              condition "pos().x >0.5";
 
	}

	regiao_2
	{
		field p;
		expression "1";
              condition "pos().x <=0.5";
 
	}

	regiao_1
	{
		field T;
		expression "0.4";
              condition "pos().x >0.5";
 
	}

	regiao_2
	{
		field T;
		expression "0.5";
              condition "pos().x <=0.5";
 
	}


	regiao_1
	{
		field B;
	       expression "vector(0.75,-1,0)";
              condition "pos().x >0.5";
 
	}

	regiao_2
	{
		field B;
		expression "vector(0.75,1,0)";
              condition "pos().x <=0.5";
 
	}


	);


